html/20231125T211812--why-i-use-denote__emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-19 Tue 21:33 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Why I use denote</title>
<meta name="author" content="Arvydas Gasparavicius" />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../static/css/org-html-style-default.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/generic.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/taingram.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/lightbox.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/scroll-to-top.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html">NOTES </a>
 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="updated">Updated: 2023-12-14 Thu 19:00</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Why I use denote</h1>
</header><p>
So last week I have decided to get to know to Denote package. Having lots of
free time, I realized that I do not like my notes structure. Maybe Denote will
help with that.
</p>

<p>
This whole Denote setup has taken way more time and effort than I expected.
Reinstalling Emacs to a newer version, fixing wsl, <a href="20231128T164359--wsl-glitches-in-gui-applications__wsl.html">reporting bugs to
Microsoft's wslg team</a>, <a href="20231211T151427--first-nixos-installation__nixos.html">remaking my emacs configuration with nixos</a>, <a href="20231126T012052--make-denote-faster-on-wsl__emacs_rsync_scripting_wsl.html">making
denote run quick</a>, transporting all my notes to denote style notes(is what I
am doing right now, for the last couple of days)&#x2026; TODO - pridek ir kaip
daryti website ir kad as ji darau lol.
</p>

<p>
I can say that the best introduction to Denote is here -
<a href="https://protesilaos.com/codelog/2022-06-18-denote-demo/">https://protesilaos.com/codelog/2022-06-18-denote-demo/</a>
</p>

<p>
By the author himself. It is nice to use the tool that was created by the
person I "know".
</p>

<p>
So yeah, intro above, docs here - <a href="https://protesilaos.com/emacs/denote">https://protesilaos.com/emacs/denote</a>
</p>
</div>
<div id="postamble" class="status">
<hr/>
	 <footer>
	 <div class="copyright-container">
	 <div class="copyright">
	 Copyright &copy; 2023-2023 Arvydas Gasparavicius
	 </div>
	 </div>
	 <p class="date">This org file is created: 2023-11-25 Sat 21:18</p>
	 <p class="date">This org file is last modified: 2023-12-14 Thu 19:00</p>
	 <p class="date">This org file is exported to HTML: 2023-12-19 Tue 21:33</p>
	 <div class="generated">
	Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6) on <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a>
	</div>
	</footer>
	 <button onclick="topFunction()" id="myBtn" title="Go to top">Top</button>
	 <script src="../static/js/generic.js"></script>
	 <script src="../static/js/scroll-to-top.js"></script>
	 <script src="../static/js/lightbox.js"></script>
</div>
</body>
</html>